docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fritz Grabo</title>
<meta name="author" content="Fritz Grabo" />
<meta name="description" content="The personal website of Fritz Grabo" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Cache-Control" content="no-store, no-cache, must-revalidate, max-age=0">
<meta http-equiv="Expires" content="0">
<meta http-equiv="Pragma" content="no-cache">
<!-- Stylesheets -->
<link rel="stylesheet" href="/styles/main.css" />
<!-- Scripts -->
<!-- Icons -->
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?">
<meta name="twitter:card" content="summary">
<meta name="twitter:site" content="@fritzgrabo">
<meta name="twitter:title" content="Fritz Grabo">
<meta name="twitter:description" content="The personal website of Fritz Grabo.">
<meta name="og:title" content="Fritz Grabo">
<meta name="og:description" content="The personal website of Fritz Grabo.">
</head>
<body>
<div id="preamble" class="status">
<p>
  <a href="/">Fritz Grabo</a> /
  <a href="/now/">Now</a> /
  <!--<a href="/past/">Past</a> /-->
  <a href="/posts/">Posts</a>
  <a href="/posts/rss.xml">(RSS)</a> /
  <a href="/contact/">Contact</a>
</p>
</div>
<div id="content" class="content">
<h1 class="title">Fritz Grabo</h1>
<section id="outline-container-10-seconds" class="outline-2">
<h2 id="10-seconds">10 seconds</h2>
<div class="outline-text-2" id="text-10-seconds">
<p>
I'm a <b><mark>self-employed senior software engineer and consultant</mark></b> with 20+ years experience in building and scaling web applications, neatly tucked away near the woods in Austria with my partner and our two kids.
</p>
</div>
</section>
<section id="outline-container-on-work" class="outline-2">
<h2 id="on-work">On work</h2>
<div class="outline-text-2" id="text-on-work">
<p>
I'm passionate about solving challenging and meaningful problems that help make the world a better place.
</p>

<p>
Technology-wise, my focus tends to fall on the backend and operations side of things, though I enjoy working on all parts and levels of a system. My preferred stack includes Ruby, Rails, PostgreSQL, and HTML/CSS/Hotwire. For operations, I'm comfortable with everything from old-school root servers to modern cloud solutions like Google Cloud or Kubernetes.
</p>

<p>
&bull;&ensp; <b>I work embedded in your team to boost its effectiveness.</b> I enjoy collaborating with fellow engineers, designers, product managers and customers to ship reliable, elegant software. Clients <a href="https://www.linkedin.com/in/fritzgrabo/details/recommendations" target="_blank">have valued</a> my positive effect on team culture, my mentoring mindset, and the overall level of quality I help establish in all the little details. I've worked remotely for most of my career and thrive in distributed teams.
</p>

<p>
&bull;&ensp; <b>I architect and implement software projects from A to Z for startups and businesses.</b> I dig deep until we both grok your actual needs, then create a simple, turnkey solution that meets them perfectly. Expect boring, trusted technology and a deliverable that's easy to understand, operate, and maintain long-term.
</p>

<p>
&bull;&ensp; <b>I draw from 20+ years of experience to consult on tech topics.</b> Let's just say I've seen a lot so you don't have to :) Specifically, if you're growing fast and want to get it right the first time, I will help defuse the costly gotchas, validate your approach, and guide your decisions.
</p>

<p>
If one of these sound like a match, do <a href="contact/">reach out!</a>
</p>
</div>
</section>
<section id="outline-container-more" class="outline-2">
<h2 id="more">More</h2>
<div class="outline-text-2" id="text-more">
<ul class="org-ul">
<li>Check out the <a href="now/">"now" page</a> to see what I'm doing now.</li>
<li>Flip through <a href="posts/">the blog posts</a> for more in-depth thoughts on <del>life</del> Emacs, mostly.</li>
<li>Browse the <a href="https://github.com/fritzgrabo" target="_blank">GitHub profile</a> if you're interested in my Open Source work.</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p>
  All original content is licensed under a custom <a href="/license/">license</a>.
</p>
</div>
</body>
</html>
